Revit 2024 API
DockablePaneState.SetFloatingRectangle Method
 When %dockPosition% is Floating, sets the rectangle used to determine the size and position of the pane when %dockPosition% is Floating. Coordinates are relative to the upper-left-hand corner of the main Revit window.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public void SetFloatingRectangle(
	Rectangle rect
)
Visual Basic
Public Sub SetFloatingRectangle ( _
	rect As Rectangle _
)
Visual C++
public:
void SetFloatingRectangle(
	Rectangle^ rect
)
Parameters
rect
Type: Autodesk.Revit.DB.Rectangle
 The rectangle to use when floating.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Rectangle is not normalized.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
DockablePaneState Class
Autodesk.Revit.UI Namespace